{
  "how to play the qanun": "Strum, smile, repeat! 🙂 Hold the qanun on your lap, attach the little plectra to your index fingers, and pluck near the bridge. Start with simple arpeggios like C–E–G and keep your wrist relaxed. Practice slowly, then speed up.",
  "how to play the instrument": "Strum, smile, repeat! 🙂 Hold the qanun on your lap, attach the little plectra to your index fingers, and pluck near the bridge. Start with simple arpeggios like C–E–G and keep your wrist relaxed. Practice slowly, then speed up.",
  "what else qanun do": "The qanun sings solos, accompanies orchestras, slides into microtonal magic with its levers, and can go from soft lullaby to dramatic epic in one graceful pluck.",
  "can you teach me how to play it": "Yes! Put on the plectra, tune a course to C, practice plucking C–E–G slowly, then move to small scales. Repeat daily — 5 minutes a day keeps the sour notes away.",
  "can you teach me how to play string": "Yes! Put on the plectra, tune a course to C, practice plucking C–E–G slowly, then move to small scales. Repeat daily — 5 minutes a day keeps the sour notes away.",
  "which string can play": "The qanun's strings are grouped in courses (usually triples). Each course is tuned to a note; to change sharps/flats use the mandal levers. Example: to play C#, pluck the C course and flip the C mandal up. Tell me the specific note and I'll point to the exact course.",
  "can it play eastern music": "Absolutely — it’s made for eastern music and microtones. With different tuning it can also play western, jazz, pop, or other styles. Name a style and I’ll explain how the qanun would do it.",
  "what is expressive melodies": "Expressive melodies are musical sentences full of feeling — timing, ornamentation, dynamics and microtones shape emotion. On the qanun, mandals and gentle plucks make the melody expressive.",
  "ask about other instruments": "I only have qanun knowledge in my base. I can’t answer about oud, piano, guitar, or other instruments here.",
  "is qanun big or small": "Middle-sized: big enough to look impressive, small enough to carry with care. Think of a shallow wooden tray with strings.",
  "is qanun heavy": "Not heavy like gym gear, but not weightless. Light enough to carry with one arm carefully, heavy enough to respect.",
  "how many strings does qanun have": "Typically around 78 strings arranged in grouped courses (usually triples). Configurations can vary.",
  "can you show me how to play it (again)": "Micro-lesson: sit comfortably, attach plectra, pluck single course slowly (1–2–3) for 5 minutes, practice a 3-note scale, add ornamentation, repeat daily.",
  "who created qanun": "No single inventor — the qanun evolved over centuries in the ancient Middle East (Mesopotamia and neighboring regions).",
  "who was the first qanun player": "Lost to time — early players weren’t recorded. The instrument emerged gradually and many cultures contributed to it.",
  "can you show me a video": "I don’t store videos here, but I can give step-by-step text lessons. For videos, search 'qanun beginner lesson' and follow along while I guide you.",
  "why are you called saleh": "I'm named Saleh as a tribute to the qanun player Mohamed Abdo Saleh who performed with Umm Kulthum — a musical nod to a great tradition."
}
